### CHAPTER 7
# Data Cleaning and Preparation

In [385]:
import pandas as pd
import numpy as np

In [386]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [387]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [388]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [389]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [390]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [391]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [392]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [393]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [394]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [395]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [396]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [397]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [398]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [399]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -2.031797  0.919817 -1.652614
1  0.980106  0.248550 -0.798211
2  0.748401  0.764647 -0.292988
3 -1.824690  1.558882  1.662057
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

In [400]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -2.031797       NaN       NaN
1  0.980106       NaN       NaN
2  0.748401       NaN -0.292988
3 -1.824690       NaN  1.662057
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

In [401]:
df.dropna()

          0         1         2
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

In [402]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2  0.748401       NaN -0.292988
3 -1.824690       NaN  1.662057
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

### Filling In Missing Data

In [403]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0 -2.031797  0.000000  0.000000
1  0.980106  0.000000  0.000000
2  0.748401  0.000000 -0.292988
3 -1.824690  0.000000  1.662057
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

In [404]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0 -2.031797  0.500000  0.000000
1  0.980106  0.500000  0.000000
2  0.748401  0.500000 -0.292988
3 -1.824690  0.500000  1.662057
4  0.481082  0.026736 -1.717518
5  1.232602  1.265160 -0.352547
6 -0.680533  0.867559 -0.216317

In [405]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.982325  0.934553 -1.437896
1  1.337733 -0.901887 -0.218884
2 -0.585667       NaN -0.816759
3 -0.239415       NaN  3.324022
4  0.191454       NaN       NaN
5  0.632598       NaN       NaN

In [406]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_3528\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0  0.982325  0.934553 -1.437896
1  1.337733 -0.901887 -0.218884
2 -0.585667 -0.901887 -0.816759
3 -0.239415 -0.901887  3.324022
4  0.191454 -0.901887  3.324022
5  0.632598 -0.901887  3.324022

In [407]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_3528\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0  0.982325  0.934553 -1.437896
1  1.337733 -0.901887 -0.218884
2 -0.585667 -0.901887 -0.816759
3 -0.239415 -0.901887  3.324022
4  0.191454       NaN  3.324022
5  0.632598       NaN  3.324022

In [408]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [409]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [410]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [411]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [412]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [413]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [414]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [415]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [416]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [417]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [418]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [419]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object